In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## 第三章 索引
### Ex1：公司员工数据集

In [2]:
df = pd.read_csv('./data/Company.csv')
df

,EmployeeID,birthdate_key,age,city_name,department,job_title,gender
0,1318,1/3/1954,61,Vancouver,Executive,CEO,M
1,1319,1/3/1957,58,Vancouver,Executive,VP Stores,F
2,1320,1/2/1955,60,Vancouver,Executive,Legal Counsel,F
3,1321,1/2/1959,56,Vancouver,Executive,VP Human Resources,M
4,1322,1/9/1958,57,Vancouver,Executive,VP Finance,M
...,...,...,...,...,...,...,...
6279,8036,8/9/1992,23,New Westminister,Customer Service,Cashier,F
6280,8181,9/26/1993,22,Prince George,Customer Service,Cashier,M
6281,8223,2/11/1994,21,Trail,Customer Service,Cashier,M
6282,8226,2/16/1994,21,Victoria,Customer Service,Cashier,F
6283,8264,6/13/1994,21,Vancouver,Customer Service,Cashier,F

#### 1. 分别只使用query和loc选出年龄不超过四十岁且工作部门为Dairy或Bakery的男性。

In [3]:
df.query('((department=="Dairy") | (department == "Bakery")) &(gender=="M")&(age<=40)')

# 更简洁的写法
dpt = ['Dairy', 'Bakery']
df.query('(department == @dpt) &(gender=="M")&(age<=40)')

,EmployeeID,birthdate_key,age,city_name,department,job_title,gender
3611,5791,1/14/1975,40,Kelowna,Dairy,Dairy Person,M
3613,5793,1/22/1975,40,Richmond,Bakery,Baker,M
3615,5795,1/30/1975,40,Nanaimo,Dairy,Dairy Person,M
3617,5797,2/3/1975,40,Nanaimo,Dairy,Dairy Person,M
3618,5798,2/4/1975,40,Surrey,Dairy,Dairy Person,M
...,...,...,...,...,...,...,...
6108,8307,10/20/1994,21,Burnaby,Dairy,Dairy Person,M
6113,8312,11/12/1994,21,Burnaby,Dairy,Dairy Person,M
6137,8336,12/31/1994,21,Vancouver,Dairy,Dairy Person,M
6270,6312,5/14/1979,36,Grand Forks,Dairy,Dairy Person,M
6271,6540,2/14/1981,34,Victoria,Bakery,Baker,M

In [4]:
df.loc[df.department.isin(['Dairy', 'Bakery']) & (df.gender == "M") & (df.age <= 40)].head()

      EmployeeID birthdate_key  age city_name department     job_title gender
3611        5791     1/14/1975   40   Kelowna      Dairy  Dairy Person      M
3613        5793     1/22/1975   40  Richmond     Bakery         Baker      M
3615        5795     1/30/1975   40   Nanaimo      Dairy  Dairy Person      M
3617        5797      2/3/1975   40   Nanaimo      Dairy  Dairy Person      M
3618        5798      2/4/1975   40    Surrey      Dairy  Dairy Person      M

#### 2.选出员工ID号 为奇数所在行的第1、第3和倒数第2列。

In [5]:
df.iloc[(df.EmployeeID % 2 == 1).values, [0, 2, -2]]

      EmployeeID  age                      job_title
1           1319   58                      VP Stores
3           1321   56             VP Human Resources
5           1323   53      Exec Assistant, VP Stores
6           1325   51  Exec Assistant, Legal Counsel
8           1329   48                  Store Manager
...          ...  ...                            ...
6276        7659   26                        Cashier
6277        7741   25                        Cashier
6278        7801   25                   Dairy Person
6280        8181   22                        Cashier
6281        8223   21                        Cashier

[3126 rows x 3 columns]

#### 按照以下步骤进行索引操作：
* 把后三列设为索引后交换内外两层
* 恢复中间层索引
* 修改外层索引名为Gender
* 用下划线合并两层行索引
* 把行索引拆分为原状态
* 修改索引名为原表名称
* 恢复默认索引并将列保持为原表的相对位置

In [12]:
df_op = df.copy()
df_op.columns[-3:].tolist()
df_op = df_op.set_index(df_op.columns[-3:].tolist())
df_op

                                            EmployeeID birthdate_key  age  \
department       job_title          gender
Executive        CEO                M             1318      1/3/1954   61
                 VP Stores          F             1319      1/3/1957   58
                 Legal Counsel      F             1320      1/2/1955   60
                 VP Human Resources M             1321      1/2/1959   56
                 VP Finance         M             1322      1/9/1958   57
...                                                ...           ...  ...
Customer Service Cashier            F             8036      8/9/1992   23
                                    M             8181     9/26/1993   22
                                    M             8223     2/11/1994   21
                                    F             8226     2/16/1994   21
                                    F             8264     6/13/1994   21

                                                   city_name
department       job_title          gender
Executive        CEO                M              Vancouver
                 VP Stores          F              Vancouver
                 Legal Counsel      F              Vancouver
                 VP Human Resources M              Vancouver
                 VP Finance         M              Vancouver
...                                                      ...
Customer Service Cashier            F       New Westminister
                                    M          Prince George
                                    M                  Trail
                                    F               Victoria
                                    F              Vancouver

[6284 rows x 4 columns]

In [15]:
# 交换索引层
df_op = df_op.swaplevel(0, 2, axis=0)
df_op

                                            EmployeeID birthdate_key  age  \
gender job_title          department
M      CEO                Executive               1318      1/3/1954   61
F      VP Stores          Executive               1319      1/3/1957   58
       Legal Counsel      Executive               1320      1/2/1955   60
M      VP Human Resources Executive               1321      1/2/1959   56
       VP Finance         Executive               1322      1/9/1958   57
...                                                ...           ...  ...
F      Cashier            Customer Service        8036      8/9/1992   23
M      Cashier            Customer Service        8181     9/26/1993   22
                          Customer Service        8223     2/11/1994   21
F      Cashier            Customer Service        8226     2/16/1994   21
                          Customer Service        8264     6/13/1994   21

                                                   city_name
gender job_title          department
M      CEO                Executive                Vancouver
F      VP Stores          Executive                Vancouver
       Legal Counsel      Executive                Vancouver
M      VP Human Resources Executive                Vancouver
       VP Finance         Executive                Vancouver
...                                                      ...
F      Cashier            Customer Service  New Westminister
M      Cashier            Customer Service     Prince George
                          Customer Service             Trail
F      Cashier            Customer Service          Victoria
                          Customer Service         Vancouver

[6284 rows x 4 columns]

In [16]:
df_op = df_op.reset_index(level=1)
df_op

                                  job_title  EmployeeID birthdate_key  age  \
gender department
M      Executive                        CEO        1318      1/3/1954   61
F      Executive                  VP Stores        1319      1/3/1957   58
       Executive              Legal Counsel        1320      1/2/1955   60
M      Executive         VP Human Resources        1321      1/2/1959   56
       Executive                 VP Finance        1322      1/9/1958   57
...                                     ...         ...           ...  ...
F      Customer Service             Cashier        8036      8/9/1992   23
M      Customer Service             Cashier        8181     9/26/1993   22
       Customer Service             Cashier        8223     2/11/1994   21
F      Customer Service             Cashier        8226     2/16/1994   21
       Customer Service             Cashier        8264     6/13/1994   21

                                city_name
gender department
M      Executive                Vancouver
F      Executive                Vancouver
       Executive                Vancouver
M      Executive                Vancouver
       Executive                Vancouver
...                                   ...
F      Customer Service  New Westminister
M      Customer Service     Prince George
       Customer Service             Trail
F      Customer Service          Victoria
       Customer Service         Vancouver

[6284 rows x 5 columns]

In [20]:
# 修改外层索引名为Gender
df_op.rename_axis(index={'gender': 'Gender'}).head()

                            job_title  EmployeeID birthdate_key  age  \
Gender department
M      Executive                  CEO        1318      1/3/1954   61
F      Executive            VP Stores        1319      1/3/1957   58
       Executive        Legal Counsel        1320      1/2/1955   60
M      Executive   VP Human Resources        1321      1/2/1959   56
       Executive           VP Finance        1322      1/9/1958   57

                   city_name
Gender department
M      Executive   Vancouver
F      Executive   Vancouver
       Executive   Vancouver
M      Executive   Vancouver
       Executive   Vancouver

In [31]:
# 用下划线合并两层行索引
df_op.index = df_op.index.map(lambda x: '_'.join(x))
df_op

                             job_title  EmployeeID birthdate_key  age  \
M Executive                        CEO        1318      1/3/1954   61
F Executive                  VP Stores        1319      1/3/1957   58
  Executive              Legal Counsel        1320      1/2/1955   60
M Executive         VP Human Resources        1321      1/2/1959   56
  Executive                 VP Finance        1322      1/9/1958   57
...                                ...         ...           ...  ...
F Customer Service             Cashier        8036      8/9/1992   23
M Customer Service             Cashier        8181     9/26/1993   22
  Customer Service             Cashier        8223     2/11/1994   21
F Customer Service             Cashier        8226     2/16/1994   21
  Customer Service             Cashier        8264     6/13/1994   21

                           city_name
M Executive                Vancouver
F Executive                Vancouver
  Executive                Vancouver
M Executive                Vancouver
  Executive                Vancouver
...                              ...
F Customer Service  New Westminister
M Customer Service     Prince George
  Customer Service             Trail
F Customer Service          Victoria
  Customer Service         Vancouver

[6284 rows x 5 columns]

In [30]:
# 把行索引拆分为原状态
df_op.index = df_op.index.map(lambda x: tuple(x.split('_')))
df_op

                             job_title  EmployeeID birthdate_key  age  \
M Executive                        CEO        1318      1/3/1954   61
F Executive                  VP Stores        1319      1/3/1957   58
  Executive              Legal Counsel        1320      1/2/1955   60
M Executive         VP Human Resources        1321      1/2/1959   56
  Executive                 VP Finance        1322      1/9/1958   57
...                                ...         ...           ...  ...
F Customer Service             Cashier        8036      8/9/1992   23
M Customer Service             Cashier        8181     9/26/1993   22
  Customer Service             Cashier        8223     2/11/1994   21
F Customer Service             Cashier        8226     2/16/1994   21
  Customer Service             Cashier        8264     6/13/1994   21

                           city_name
M Executive                Vancouver
F Executive                Vancouver
  Executive                Vancouver
M Executive                Vancouver
  Executive                Vancouver
...                              ...
F Customer Service  New Westminister
M Customer Service     Prince George
  Customer Service             Trail
F Customer Service          Victoria
  Customer Service         Vancouver

[6284 rows x 5 columns]

In [33]:
# 修改索引名为原表名称
df_op = df_op.rename_axis(index=['gender', 'department'])
df_op

                                  job_title  EmployeeID birthdate_key  age  \
gender department
M      Executive                        CEO        1318      1/3/1954   61
F      Executive                  VP Stores        1319      1/3/1957   58
       Executive              Legal Counsel        1320      1/2/1955   60
M      Executive         VP Human Resources        1321      1/2/1959   56
       Executive                 VP Finance        1322      1/9/1958   57
...                                     ...         ...           ...  ...
F      Customer Service             Cashier        8036      8/9/1992   23
M      Customer Service             Cashier        8181     9/26/1993   22
       Customer Service             Cashier        8223     2/11/1994   21
F      Customer Service             Cashier        8226     2/16/1994   21
       Customer Service             Cashier        8264     6/13/1994   21

                                city_name
gender department
M      Executive                Vancouver
F      Executive                Vancouver
       Executive                Vancouver
M      Executive                Vancouver
       Executive                Vancouver
...                                   ...
F      Customer Service  New Westminister
M      Customer Service     Prince George
       Customer Service             Trail
F      Customer Service          Victoria
       Customer Service         Vancouver

[6284 rows x 5 columns]

In [35]:
# 恢复默认索引并将列保持为原表的相对位置
df_op = df_op.reset_index().reindex(df.columns, axis=1)
df_op

,EmployeeID,birthdate_key,age,city_name,department,job_title,gender
0,1318,1/3/1954,61,Vancouver,Executive,CEO,M
1,1319,1/3/1957,58,Vancouver,Executive,VP Stores,F
2,1320,1/2/1955,60,Vancouver,Executive,Legal Counsel,F
3,1321,1/2/1959,56,Vancouver,Executive,VP Human Resources,M
4,1322,1/9/1958,57,Vancouver,Executive,VP Finance,M
...,...,...,...,...,...,...,...
6279,8036,8/9/1992,23,New Westminister,Customer Service,Cashier,F
6280,8181,9/26/1993,22,Prince George,Customer Service,Cashier,M
6281,8223,2/11/1994,21,Trail,Customer Service,Cashier,M
6282,8226,2/16/1994,21,Victoria,Customer Service,Cashier,F
6283,8264,6/13/1994,21,Vancouver,Customer Service,Cashier,F

### Ex2：巧克力数据集

In [37]:
df = pd.read_csv('./data/chocolate.csv')
df.head()

    Company  Review\nDate Cocoa\nPercent Company\nLocation  Rating
0  A. Morin          2016            63%            France    3.75
1  A. Morin          2015            70%            France    2.75
2  A. Morin          2015            70%            France    3.00
3  A. Morin          2015            70%            France    3.50
4  A. Morin          2015            70%            France    3.50

* 把列索引名中的\n替换为空格。
* 巧克力Rating评分为1至5，每0.25分一档，请选出2.75分及以下且可可含量Cocoa Percent高于中位数的样本。
* 将Review Date和Company Location设为索引后，选出Review Date在2012年之后且Company Location不属于France, Canada, Amsterdam, Belgium的样本。

In [38]:
df.columns = [' '.join(i.split('\n')) for i in df.columns]
df

       Company  Review Date Cocoa Percent Company Location  Rating
0     A. Morin         2016           63%           France    3.75
1     A. Morin         2015           70%           France    2.75
2     A. Morin         2015           70%           France    3.00
3     A. Morin         2015           70%           France    3.50
4     A. Morin         2015           70%           France    3.50
...        ...          ...           ...              ...     ...
1790    Zotter         2011           70%          Austria    3.75
1791    Zotter         2011           65%          Austria    3.00
1792    Zotter         2011           65%          Austria    3.50
1793    Zotter         2011           62%          Austria    3.25
1794    Zotter         2010           65%          Austria    3.00

[1795 rows x 5 columns]

In [40]:
# 巧克力Rating评分为1至5，每0.25分一档，请选出2.75分及以下且可可含量Cocoa Percent高于中位数的样本。
df['Cocoa Percent'] = df['Cocoa Percent'].apply(lambda x: float(x[:-1]) / 100)
df.query('(Rating<3)&(`Cocoa Percent`>`Cocoa Percent`.median())').head(3)

TypeError: 'float' object is not subscriptable

In [42]:
# 将Review Date和Company Location设为索引后，选出Review Date在2012年之后且Company Location不属于France, Canada, Amsterdam, Belgium的样本。
idx = pd.IndexSlice
exclude = ['France', 'Canada', 'Amsterdam', 'Belgium']
res = df.set_index(['Review Date', 'Company Location']).sort_index(level=0)
res.loc[idx[2012:, ~res.index.get_level_values(1).isin(exclude)], :].head(3)